
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7932463795)



<pre><code>Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gVWns5lI4lym-G25IGQo-Ue02_bPpHNWOowuhsIubDU7bz6WNex7QmUh58PB4f-jfahG5OWBYaBHV5CRKAxT9urmhefabpSmo78SHJtv-f
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gPPPigZhpZm_c6626vMvnJ5qYwTWWEFC_tFUm_8IWErqzaH7p80sUcBxwL2RLLSPBHmj7FSs9M_SdiNsrYrguF0GKknH3JkCtciwXF9Fb0
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gIML2M6cS2pEbV-_YNnAxJ3ySzEkZmvUyogtqLoUkzcgPoxRd00i43T4X4SMcVAoU0fhGn_vg17QmhjKZ5gUBsZNbq1c13vQMQ1128QYf0
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gCih0ntTuQkxU7PJRknMfSTpK47m2-_eLLSZ5X8X-BxFWAjDTnxpJOOoWuKnynSdMkqZiDqOl6emkOt05gI_85fwZkTk6KsmFspQ5xeXr3
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error creating Connector: googleapi: Error 403: Serverless VPC Access API has not been used in project gig-japan-398904 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.Help&#34;,
    &#34;links&#34;: [
      {
        &#34;description&#34;: &#34;Google developers console API activation&#34;,
        &#34;url&#34;: &#34;https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;consumer&#34;: &#34;projects/gig-japan-398904&#34;,
      &#34;service&#34;: &#34;vpcaccess.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;SERVICE_DISABLED&#34;
  }
]

  with google_vpc_access_connector.vpc-connector,
  on network.tf line 7, in resource &#34;google_vpc_access_connector&#34; &#34;vpc-connector&#34;:
   7: resource &#34;google_vpc_access_connector&#34; &#34;vpc-connector&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.backend-api-resources[&#34;secretmanager.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_project_service.frontend-api-resources[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.frontend-api-resources[&#34;identitytoolkit.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.frontend-api-resources[&#34;firestore.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]%0Agoogle_project_service.backend-api-resources[&#34;run.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.writer&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/iam.workloadIdentityUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_project_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_auth_domain&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;base_endpoint&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_storage_bucket&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;user_auth&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;environment&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_app_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_messaging_sender_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.backend-sa-secret[&#34;weather_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A        id               = &#34;projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai&#34;%0A        name             = &#34;ikigai&#34;%0A        # (10 unchanged attributes hidden)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = false%0A        }%0A    }%0A%0A  # google_compute_network.vpc-network will be created%0A  &#43; resource &#34;google_compute_network&#34; &#34;vpc-network&#34; {%0A      &#43; auto_create_subnetworks                   = true%0A      &#43; delete_default_routes_on_create           = false%0A      &#43; gateway_ipv4                              = (known after apply)%0A      &#43; id                                        = (known after apply)%0A      &#43; internal_ipv6_range                       = (known after apply)%0A      &#43; mtu                                       = (known after apply)%0A      &#43; name                                      = &#34;vpc-network&#34;%0A      &#43; network_firewall_policy_enforcement_order = &#34;AFTER_CLASSIC_FIREWALL&#34;%0A      &#43; numeric_id                                = (known after apply)%0A      &#43; project                                   = &#34;gig-japan-398904&#34;%0A      &#43; routing_mode                              = (known after apply)%0A      &#43; self_link                                 = (known after apply)%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_vpc_access_connector.vpc-connector will be created%0A  &#43; resource &#34;google_vpc_access_connector&#34; &#34;vpc-connector&#34; {%0A      &#43; connected_projects = (known after apply)%0A      &#43; id                 = (known after apply)%0A      &#43; ip_cidr_range      = &#34;20.8.2.0/28&#34;%0A      &#43; machine_type       = &#34;e2-micro&#34;%0A      &#43; max_instances      = (known after apply)%0A      &#43; max_throughput     = 300%0A      &#43; min_instances      = (known after apply)%0A      &#43; min_throughput     = 200%0A      &#43; name               = &#34;connector&#34;%0A      &#43; network            = &#34;vpc-network&#34;%0A      &#43; project            = &#34;gig-japan-398904&#34;%0A      &#43; region             = &#34;asia-northeast1&#34;%0A      &#43; self_link          = (known after apply)%0A      &#43; state              = (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 4 to destroy.%0A%0AChanges to Outputs:%0A  &#43; vpc_connector_ip_range = &#34;20.8.2.0/28&#34;%0A  &#43; vpc_connector_name     = &#34;connector&#34;%0Agoogle_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_compute_network.vpc-network: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 1s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_compute_network.vpc-network: Still creating... [10s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [20s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [30s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [40s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [50s elapsed]%0Agoogle_compute_network.vpc-network: Creation complete after 53s [id=projects/gig-japan-398904/global/networks/vpc-network]%0Agoogle_vpc_access_connector.vpc-connector: Creating...%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gVWns5lI4lym-G25IGQo-Ue02_bPpHNWOowuhsIubDU7bz6WNex7QmUh58PB4f-jfahG5OWBYaBHV5CRKAxT9urmhefabpSmo78SHJtv-f%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gPPPigZhpZm_c6626vMvnJ5qYwTWWEFC_tFUm_8IWErqzaH7p80sUcBxwL2RLLSPBHmj7FSs9M_SdiNsrYrguF0GKknH3JkCtciwXF9Fb0%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gIML2M6cS2pEbV-_YNnAxJ3ySzEkZmvUyogtqLoUkzcgPoxRd00i43T4X4SMcVAoU0fhGn_vg17QmhjKZ5gUBsZNbq1c13vQMQ1128QYf0%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gCih0ntTuQkxU7PJRknMfSTpK47m2-_eLLSZ5X8X-BxFWAjDTnxpJOOoWuKnynSdMkqZiDqOl6emkOt05gI_85fwZkTk6KsmFspQ5xeXr3%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error creating Connector: googleapi: Error 403: Serverless VPC Access API has not been used in project gig-japan-398904 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.Help&#34;,%0A    &#34;links&#34;: [%0A      {%0A        &#34;description&#34;: &#34;Google developers console API activation&#34;,%0A        &#34;url&#34;: &#34;https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;consumer&#34;: &#34;projects/gig-japan-398904&#34;,%0A      &#34;service&#34;: &#34;vpcaccess.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;SERVICE_DISABLED&#34;%0A  }%0A]%0A%0A  with google_vpc_access_connector.vpc-connector,%0A  on network.tf line 7, in resource &#34;google_vpc_access_connector&#34; &#34;vpc-connector&#34;:%0A   7: resource &#34;google_vpc_access_connector&#34; &#34;vpc-connector&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/1f34a0ce-c38f-4e9b-b9f6-bace0ff84335/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_project_service.frontend-api-resources["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.frontend-api-resources["identitytoolkit.googleapis.com"]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.frontend-api-resources["firestore.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_secret_manager_secret.frontend-secrets["firebase_project_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]
google_secret_manager_secret.frontend-secrets["firebase_auth_domain"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]
google_secret_manager_secret.frontend-secrets["firebase_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]
google_secret_manager_secret.frontend-secrets["base_endpoint"]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]
google_secret_manager_secret.frontend-secrets["firebase_storage_bucket"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]
google_secret_manager_secret.frontend-secrets["user_auth"]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]
google_secret_manager_secret.frontend-secrets["environment"]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]
google_secret_manager_secret.frontend-secrets["firebase_app_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]
google_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_compute_network.vpc-network will be created
  + resource "google_compute_network" "vpc-network" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "gig-japan-398904"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_vpc_access_connector.vpc-connector will be created
  + resource "google_vpc_access_connector" "vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "20.8.2.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "connector"
      + network            = "vpc-network"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 2 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  + vpc_connector_ip_range = "20.8.2.0/28"
  + vpc_connector_name     = "connector"
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_compute_network.vpc-network: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 1s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_compute_network.vpc-network: Still creating... [10s elapsed]
google_compute_network.vpc-network: Still creating... [20s elapsed]
google_compute_network.vpc-network: Still creating... [30s elapsed]
google_compute_network.vpc-network: Still creating... [40s elapsed]
google_compute_network.vpc-network: Still creating... [50s elapsed]
google_compute_network.vpc-network: Creation complete after 53s [id=projects/gig-japan-398904/global/networks/vpc-network]
google_vpc_access_connector.vpc-connector: Creating...

Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gVWns5lI4lym-G25IGQo-Ue02_bPpHNWOowuhsIubDU7bz6WNex7QmUh58PB4f-jfahG5OWBYaBHV5CRKAxT9urmhefabpSmo78SHJtv-f
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gPPPigZhpZm_c6626vMvnJ5qYwTWWEFC_tFUm_8IWErqzaH7p80sUcBxwL2RLLSPBHmj7FSs9M_SdiNsrYrguF0GKknH3JkCtciwXF9Fb0
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gIML2M6cS2pEbV-_YNnAxJ3ySzEkZmvUyogtqLoUkzcgPoxRd00i43T4X4SMcVAoU0fhGn_vg17QmhjKZ5gUBsZNbq1c13vQMQ1128QYf0
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-gCih0ntTuQkxU7PJRknMfSTpK47m2-_eLLSZ5X8X-BxFWAjDTnxpJOOoWuKnynSdMkqZiDqOl6emkOt05gI_85fwZkTk6KsmFspQ5xeXr3
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error creating Connector: googleapi: Error 403: Serverless VPC Access API has not been used in project gig-japan-398904 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.Help",
    "links": [
      {
        "description": "Google developers console API activation",
        "url": "https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "googleapis.com",
    "metadata": {
      "consumer": "projects/gig-japan-398904",
      "service": "vpcaccess.googleapis.com"
    },
    "reason": "SERVICE_DISABLED"
  }
]

  with google_vpc_access_connector.vpc-connector,
  on network.tf line 7, in resource "google_vpc_access_connector" "vpc-connector":
   7: resource "google_vpc_access_connector" "vpc-connector" {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_project_service.frontend-api-resources["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.frontend-api-resources["identitytoolkit.googleapis.com"]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.frontend-api-resources["firestore.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_project_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_auth_domain"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-secrets["base_endpoint"]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_storage_bucket"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-secrets["user_auth"]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_secret_manager_secret.frontend-secrets["environment"]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_app_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0Agoogle_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_compute_network.vpc-network will be created%0A  + resource "google_compute_network" "vpc-network" {%0A      + auto_create_subnetworks                   = true%0A      + delete_default_routes_on_create           = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = (known after apply)%0A      + name                                      = "vpc-network"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + numeric_id                                = (known after apply)%0A      + project                                   = "gig-japan-398904"%0A      + routing_mode                              = (known after apply)%0A      + self_link                                 = (known after apply)%0A    }%0A%0A  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_vpc_access_connector.vpc-connector will be created%0A  + resource "google_vpc_access_connector" "vpc-connector" {%0A      + connected_projects = (known after apply)%0A      + id                 = (known after apply)%0A      + ip_cidr_range      = "20.8.2.0/28"%0A      + machine_type       = "e2-micro"%0A      + max_instances      = (known after apply)%0A      + max_throughput     = 300%0A      + min_instances      = (known after apply)%0A      + min_throughput     = 200%0A      + name               = "connector"%0A      + network            = "vpc-network"%0A      + project            = "gig-japan-398904"%0A      + region             = "asia-northeast1"%0A      + self_link          = (known after apply)%0A      + state              = (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 4 to destroy.%0A%0AChanges to Outputs:%0A  + vpc_connector_ip_range = "20.8.2.0/28"%0A  + vpc_connector_name     = "connector"%0Agoogle_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_compute_network.vpc-network: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 1s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_compute_network.vpc-network: Still creating... [10s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [20s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [30s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [40s elapsed]%0Agoogle_compute_network.vpc-network: Still creating... [50s elapsed]%0Agoogle_compute_network.vpc-network: Creation complete after 53s [id=projects/gig-japan-398904/global/networks/vpc-network]%0Agoogle_vpc_access_connector.vpc-connector: Creating...%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gVWns5lI4lym-G25IGQo-Ue02_bPpHNWOowuhsIubDU7bz6WNex7QmUh58PB4f-jfahG5OWBYaBHV5CRKAxT9urmhefabpSmo78SHJtv-f%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gPPPigZhpZm_c6626vMvnJ5qYwTWWEFC_tFUm_8IWErqzaH7p80sUcBxwL2RLLSPBHmj7FSs9M_SdiNsrYrguF0GKknH3JkCtciwXF9Fb0%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gIML2M6cS2pEbV-_YNnAxJ3ySzEkZmvUyogtqLoUkzcgPoxRd00i43T4X4SMcVAoU0fhGn_vg17QmhjKZ5gUBsZNbq1c13vQMQ1128QYf0%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-gCih0ntTuQkxU7PJRknMfSTpK47m2-_eLLSZ5X8X-BxFWAjDTnxpJOOoWuKnynSdMkqZiDqOl6emkOt05gI_85fwZkTk6KsmFspQ5xeXr3%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error creating Connector: googleapi: Error 403: Serverless VPC Access API has not been used in project gig-japan-398904 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.Help",%0A    "links": [%0A      {%0A        "description": "Google developers console API activation",%0A        "url": "https://console.developers.google.com/apis/api/vpcaccess.googleapis.com/overview?project=gig-japan-398904"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "googleapis.com",%0A    "metadata": {%0A      "consumer": "projects/gig-japan-398904",%0A      "service": "vpcaccess.googleapis.com"%0A    },%0A    "reason": "SERVICE_DISABLED"%0A  }%0A]%0A%0A  with google_vpc_access_connector.vpc-connector,%0A  on network.tf line 7, in resource "google_vpc_access_connector" "vpc-connector":%0A   7: resource "google_vpc_access_connector" "vpc-connector" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":64,"Program":"tfcmt","SHA1":"2b6131378e510d0050b63806146d6e3005caf023","Vars":{},"WorkflowName":"iaac_apply"} -->